cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Письмо/Ext/ManagerModule.bsl
Функция СформироватьПараметрыПисьма(Письмо,
									знач ПриведенныйПочтовыйАдрес,
                                    знач Пароль = Неопределено)
	// Проверяет возможность отправления письма и если
	// это возможно - формирует параметры отправки
	//

	ПараметрыПисьма = Новый Структура;
	
	//Если ЗначениеЗаполнено(Пароль) Тогда
	//	ПараметрыПисьма.Вставить("Пароль", Пароль);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриведенныйПочтовыйАдрес) Тогда
		ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(АдресОтвета) Тогда
	//	ПараметрыПисьма.Вставить("АдресОтвета", АдресОтвета);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Письмо.Тема) Тогда
		ПараметрыПисьма.Вставить("Тема", Письмо.Тема);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Письмо.Текст) Тогда
		ПараметрыПисьма.Вставить("Тело", Письмо.Текст);
	КонецЕсли;

	Если ЗначениеЗаполнено(Письмо.Текст) Тогда
		ПараметрыПисьма.Вставить("ТипТекста", Письмо.ТипТекста);
	КонецЕсли;

	
	Возврат ПараметрыПисьма;
	
КонецФункции

Функция ПослатьПисьмо(Письмо, стрОшибки = "") Экспорт
	
	Попытка
		ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Письмо.Кому);
	Исключение
		стрОшибки = ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Пароль 			= Письмо.УчетнаяЗапись.Пароль;
	ПараметрыПисьма = СформироватьПараметрыПисьма(Письмо, ПриведенныйПочтовыйАдрес);
	
	Если ПараметрыПисьма = Неопределено Тогда
		стрОшибки = НСтр("ru = 'Ошибка формирования параметров почтового сообщения'");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(Письмо.УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		стрОшибки = ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции


Функция ПослатьПисьмо_Нов(ДокПисьмо, стрОшибки = "") Экспорт

 	Попытка
		ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ДокПисьмо.Кому);
	Исключение
		стрОшибки = ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Пароль 			= ДокПисьмо.УчетнаяЗапись.Пароль;
	ПараметрыПисьма = СформироватьПараметрыПисьма(ДОкПисьмо, ПриведенныйПочтовыйАдрес);
	
	Если ПараметрыПисьма = Неопределено Тогда
		стрОшибки = НСтр("ru = 'Ошибка формирования параметров почтового сообщения'");
		Возврат Ложь;
	КонецЕсли;
	

		
			
	Если ТипЗнч(ДокПисьмо.Кому) = Тип("Строка") Тогда
		Кому = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ДокПисьмо.Кому);
	КонецЕсли;
	
	Если ТипЗнч(ДокПисьмо.Копия) = Тип("Строка") Тогда
		Копия = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ДокПисьмо.Копия);
	КонецЕсли;

		
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	Письмо.Тема = ДокПисьмо.Тема;
	

// добавляем текст
    
    ТипТекста = Неопределено;
	Текст = Письмо.Тексты.Добавить(ПараметрыПисьма.Тело);
	Если ПараметрыПисьма.Свойство("ТипТекста", ТипТекста) Тогда
		Если ТипЗнч(ТипТекста) = Тип("Строка") Тогда
			Если      ТипТекста = "HTML" Тогда
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
				
				 
			ИначеЕсли ТипТекста = "RichText" Тогда
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.РазмеченныйТекст;
			Иначе
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТипТекста) = Тип("ПеречислениеСсылка.ТипыТекстовЭлектронныхПисем") Тогда
			Если      ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML
				  ИЛИ ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
			ИначеЕсли ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст Тогда
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.РазмеченныйТекст;
			Иначе
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
			КонецЕсли;
		Иначе
			Текст.ТипТекста = ТипТекста;
		КонецЕсли;
	Иначе
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	КонецЕсли;


	Для Каждого ПочтовыйАдресПолучателя Из Кому Цикл
		Получатель = Письмо.Получатели.Добавить(ПочтовыйАдресПолучателя.Адрес);
		Получатель.ОтображаемоеИмя = ПочтовыйАдресПолучателя.Представление;
	КонецЦикла;
	    //письмо.Копии.
	Для Каждого ПочтовыйАдресПолучателяКопия Из Копия Цикл
		ПолучательКопия = Письмо.Копии.Добавить(ПочтовыйАдресПолучателяКопия.Адрес);
	КонецЦикла;
		
	
	// добавляем к письму имя отправителя
	Письмо.ИмяОтправителя              = ДокПисьмо.УчетнаяЗапись.ИмяПользователя;
	Письмо.Отправитель.ОтображаемоеИмя = ДокПисьмо.УчетнаяЗапись.ИмяПользователя;
	Письмо.Отправитель.Адрес           = ДокПисьмо.УчетнаяЗапись.АдресЭлектроннойПочты;
	
	Профиль = ЭлектроннаяПочта.СформироватьИнтернетПрофиль(ДокПисьмо.УчетнаяЗапись);
		
	// Добавим вложения
	
	Инд = -1;
	Для Каждого Вложение Из ДокПисьмо.Вложения Цикл Инд = Инд + 1;
		
		ДвоичныеДанные = Вложение.Вложение.Получить();
		//?(Не ПустаяСтрока(Вложение.ПолноеИмяФайла), Новый ДвоичныеДанные(Вложение.ПолноеИмяФайла), ПолучитьИзВременногоХранилища(ПолучитьАдресДанныхПоИндексу(Инд)));
		
		Если ДвоичныеДанные = Неопределено Тогда
			ОбщиеФункции.СообщитьТекст("Не удалось получить вложение, повторите попытку"); Возврат ложь КонецЕсли;
		
		Письмо.Вложения.Добавить(ДвоичныеДанные, Вложение.ИмяФайла); КонецЦикла;

			
	Соединение = Новый ИнтернетПочта;
	
	Соединение.Подключиться(Профиль);
	
	Попытка
		Соединение.Послать(Письмо);
	Исключение
		стрОшибки = "Не удалось отправить письмо: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;		
	
	Соединение.Отключиться();
	
	Возврат Истина;//Письмо.ИдентификаторСообщения;

КонецФункции
